#include <iostream>
#include <cmath>

using namespace std;

int main() {

	//int a = 0;
	//*for (int i = a; i <= 10; i += 2) {
	//	cout << i << " ";
	//}*/
	//for (int i = a; i <= 10; i++) {
	//	if (i % 2 == 0) {
	//		cout << i << " ";
	//	}
	//}

	/*//Максим ніколи не буває трійок і двійок по програмуванню. 
	//Тільки четвірки та п'ятірки. Він виписав на листочок усі 20 
	//своїх оцінок, і захотів дізнатися, скільки саме у нього 
	//оцінок 4 , а скільки 5 . Збившись у підрахунках, він вирішив,
	//що буде простіше написати програму, яка виконує цю роботу.

	//5 5 5 5 5 5 5 5 5 5 4 4 5 5 5 4 5 5 5 5
	//4: 3
	//5: 17
	int a,b,c;
	b = 0;
	c = 0;

	for (int i = 0; i < 20; i++) {
		cin >> a;
		if (a == 4) {
			b++;
		}
		else {
			c++;
		}
	}
	cout << "4 : " << b << endl << "5 :" << c << endl;*/

	//Андрій вигадав натуральне число A, а Антон натуральне 
	//число B.Так як вони на уроці інформатики сидять за сусідніми
	//комп'ютерами, то вирішено було об'єднати зусилля і написати 
	//програму, яка виводить раз A число B, а слідом за ним B разів
	//число A.Напишіть і ви таку програму.
	//10 8
	//888888888881010101010101010

	int a, b;
	cin >> a >> b;
	for (int i = 0; i < a; i++) {
		cout << b;
	}
	for (int i = 0; i < b; i++) {
		cout << a;
	}

	return 0;
}