#include <iostream>

using namespace std;
//5
//-0@-<

//10
//-000000@-<

int main() 
{
	/*int n;
	cin >> n;
	cout << "-";
	for (int i = 0; i < n - 4;i++) {
		cout << "O";
	}
	cout << "@-<";*/
	//3 6 2
	//[][][]
	//[][][][][][]
	//[][]
	/*int a, b, c;
	cin >> a >> b >> c;
	for (int i = 0; i < a; i++) {
		cout << "[]";
	}

	cout << endl;
	for (int i = 0; i < b; i++) {
		cout << "[]";
	}
	cout << endl;
	for (int i = 0; i < c; i++) {
		cout << "[]";
	}*/

	//int a = 4;
	////int a = 5;
	//{
	//	int a = 6;
	//	a += 10;
	//}
	//cout << a;

	//Мишко хоче вивести на екран ряд чисел.На 
	//початку A разів має бути виведено число A.
	//Потім B разів число B.І наприкінці C разів 
	//число C.Миша поки не дуже добре розуміється
	//на тому, як працює цикл for.Напишіть таку 
	//програму, яка запитує три натуральні числа 
	//і виводить те, що хоче Мишко.
	//5 12 4
	//55555 121212121212121212121212 4444
	/*int a, b, c;
	cin >> a >> b >> c;
	for (int i = 0; i < a; i++) {
		cout << a;
	}
	cout << " ";
	for (int i = 0; i < b; i++) {
		cout << b;
	}
	cout << " ";
	for(int i = 0; i < c; i++) {
		cout << c;

	}*/

	//На вхід програми подається число N. 
	//Виведіть усі числа від 1 до N через кому в 
	//дужках, і в другому рядку той самий ряд 
	//чисел у зворотному порядку.
	
	//12
	//(1,2,3,4,5,6,7,8,9,10,11,12)
	//(12,11,10,9,8,7,6,5,4,3,2,1)
	/*int n;
	cin >> n;
	cout << "(";
	for (int i = 1; i < n; i++) {
		cout << i << ",";
	}
	cout <<n<< ")"<<endl;
	cout << "(";
	for (int i = n; i > 1; i--) {
		cout << i << ",";
	}
	cout << "1)";*/

	int a =-1;
	int count = 0;
	while (a != 0) {
		cin >> a;
		count++;
	}

	cout << count;

	return 0;
}
